
[  {
    "cell_id": 1,
    "title": "App: Air Quality and Location Info for Android and iOS",
    "skills": "Languages(Angular, Capacitor, NodeJS), HTML, CSS",
    "pic": "./images/notifai/apps/airsense1.png",
    "pic2": "./images/notifai/apps/airsense2.png",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "As an engineer at Notifai; a company making enterprise enviromental and air quality sensing solutions, I developed an app using Angular with Capacitor to make both Android and iOS versions of the app. This app pulled data from our air quality device cloud, to display to users how healthy the air is around them and any procautions they should take. Additionally it pulled from other APIs to show local air quality and weather information in an appealing and user-friendly way. View on Heroku(Note device server is offline), on desktop use browser's app mode https://hotelinterface.herokuapp.com/xinxiangncg",
    "visible": true,
    "open": false,
    "position": 1
  },
  {
    "cell_id": 2,
    "title": "Web App: Client App Creation System",
    "skills": "Languages(Angular, NodeJS)",
    "pic": "./images/notifai/apps/clientmanage1.PNG",
    "pic2": "./images/notifai/apps/clientmanage2.PNG",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "As an engineer at Notifai; a company making enterprise enviromental and air quality sensing solutions, I made a client creation system as our air quality devices were fit for entire buildings, each building required a personalised app for the company or hotel it was placed in. To quickly create a new app version with all of the personalized assets a management page was made to allow this to be done in a few minutes without needing to change any of the apps code.",
    "visible": true,
    "open": false,
    "position": 2
  },
  {
    "cell_id": 3,
    "title": "Web App: Air and Enviroment Quality Report Generator",
    "skills": "Languages(Angular, NodeJS)",
    "pic": "./images/notifai/apps/reportgen1.PNG",
    "pic2": "./images/notifai/apps/reportgen2.PNG",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "As an engineer at Notifai; a company making enterprise enviromental and air quality sensing solutions, along with needing personalized apps for showing their air quality data, businesses and hotels needed clear reports to show their air quality history. This webpage made it possible to quickly choose a client and to include any desired air quality devices. As well a variety of graph options were available to display the data and their relations in a clear way. View on Heroku(Note device server is offline) https://generate-report.herokuapp.com/",
    "visible": true,
    "open": false,
    "position": 3
  },
  {
    "cell_id": 4,
    "title": "Sample App: Boat Enviroment and Valve Interface",
    "skills": "Languages(Angular, NodeJS)",
    "pic": "./images/notifai/apps/boatvalve1.PNG",
    "pic2": "./images/notifai/apps/boatvalve2.PNG",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "As an engineer at Notifai; a company making enterprise enviromental and air quality sensing solutions, I made a purely UI version of an app that could be used for displaying enviromental information on boats, as well as opening and closing of valves. This was built in Angular as a demo for a potential client. View on Heroku https://notifai-demo.herokuapp.com/",
    "visible": true,
    "open": false,
    "position": 1
  },
  {
    "cell_id": 5,
    "title": "Kiosk: Displaying Air Quality App and Remote Access",
    "skills": "Languages(Angular, NodeJS), Scalefusion Remore Access",
    "pic": "./images/notifai/apps/kiosk1.jpg",
    "pic2": "./images/notifai/apps/kiosk2.jpg",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "As an engineer at Notifai; a company making enterprise enviromental and air quality sensing solutions, in addition to the app I made to display our device data on phones, it was also used for a standing kiosk. This required a slightly modified version of the app to include auto switching between pages, among other additions. Furthermore the kiosks needed to be remotely accessed for updated, to do this I used Scalefusion software, which also kept the app locked open and auto opened it on power on.",
    "visible": true,
    "open": false,
    "position": 2
  },
  {
    "cell_id": 6,
    "title": "Design: Figma App Icons",
    "skills": "Figma, Iconography",
    "pic": "./images/notifai/apps/figma1.PNG",
    "pic2": "./images/notifai/apps/figma2.PNG",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "As an engineer at Notifai; a company making enterprise enviromental and air quality sensing solutions, I ⦁  used Figma vector graphics editor and prototyping tool to design icons for the air quality app I made. This also included custom icons depending on the client.",
    "visible": true,
    "open": false,
    "position": 3
  },
    {
    "cell_id": 7,
    "title": "Design: Figma TV Display Demo",
    "skills": "Figma, UI",
    "pic": "./images/notifai/apps/haxTV.jpg",
    "pic2": "./images/no-photo.png",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "As an engineer at Notifai; a company making enterprise enviromental and air quality sensing solutions, ",
    "visible": true,
    "open": false,
    "position": 1
  },


    {
    "cell_id": 8,
    "title": "Side Project Website: Personal Portfolio",
    "skills": "Languages(NodeJS, ExpressJS, ReactJS)",
    "pic": "./images/personal/personal1.png",
    "pic2": "./images/personal/personal2.png",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "The website you should be seeing this on right now is this project. The code is available publicly on Github for anyone to look at. It is made with a ReactJS frontend and an ExpressJS backend. I made it with the intention of it being easy to quickly skim through, with the option to see extra info on what you choose.",
    "visible": true,
    "open": false,
    "position": 2
  },
  {
    "cell_id": 9,
    "title": "Management System: Recycling Bins",
    "skills": "Languages(MongoDB, ExpressJS, AngularJS, NodeJS) ",
    "pic": "./images/revbin/bin1.png",
    "pic2": "./images/revbin/bin2.png",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "For my final year capstone at SFU, I was part of a team building sensor that would track weight and fill level in recycling beens to be used for textiles, and a management system to work along with it. This was build that recycles the materials as a business, this was needed so they could approximately get the value of the material they would be collecting and be able to pick up the bins more efficiently. I worked to build the bin management system using the MEAN stack, the current prototype can be seen at (revbin.ca)",
    "visible": true,
    "open": false,
    "position": 3
  },
  {
    "cell_id": 10,
    "title": "Product Interface: Security Keypad 1",
    "skills": "Languages(NodeJS, ExpressJS, ReactJS, AngularJS) ",
    "pic": "./images/keypad/WifiAP1-1.PNG",
    "pic2": "./images/keypad/WifiAP3.PNG",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "At Plasmatic Technologies, a company building a connected home security system and keypad, I built an app for the keypad to connect to the internet. This was using the process of setting the device as an Access Point then connecting inputting the info and flipping it to connect. To build the app I found an existing application except with an ExpressJS backend and AngularJS frontend. Since all of our apps were ReactJS, I learned enough AngularJS to then rebuild the frontend in ReactJS, also modifications were made to the backend to eliminate existing bugs and improve it.",
    "visible": true,
    "open": false,
    "position": 1
  },
  {
    "cell_id": 11,
    "title": "Product Interface: Security Keypad 2",
    "skills": "Languages(NodeJS, ExpressJS, ReactJS) ",
    "pic": "./images/keypad/KeypadZones2.PNG",
    "pic2": "./images/keypad/KeypadZones2Big.png",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "At Plasmatic Technologies, a company building a connected home security system and keypad, I had to make interfaces to run on the keypad's LCD screen. For this I used ReactJS and built a keypad inteface as well as status indicators for the current state of the system and its sensors. This also included buttons which could automatically arm and disarm the system to make it more user friendly. This all worked with an ExpressJS backend which would send and recieve messages with Axios and Socket.io, and communicate with other programs to send information to AWS and the MCU. ",
    "visible": true,
    "open": false,
    "position": 2
  },
  {
    "cell_id": 10,
    "title": "Side Project Website: Maker Cube Business ",
    "skills": "Languages(HTML, CSS[Bootstrap Template])",
    "pic": "./images/makercube/mc1.png",
    "pic2": "./images/makercube/mc2.png",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "While I was still a student at SFU I started a non-profit in Surrey, BC, this was called Maker Cube(makercube.ca) and was Surrey's first makerspace. The current website has been changed from what I made as we decided to go for a simpler approach. The website was made on a Bootstrap template with many modifications and included embedded components and several pages of information.",
    "visible": true,
    "open": false,
    "position": 3
  }]
