
[{
  	"cell_id": 1,
  	"title": "Branded Designs: City of Surrey",
    "skills": "3D CAD (Solidworks, Sketchup, Blender) ",
    "pic": "./images/cityofsurrey/CityHallwLogo.JPG",
    "pic2": "./images/cityofsurrey/Small Mug.JPG",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "These designs and a few others were done for the at the request of a City of Surrey (BC) employee to be used as giveaway items. To create these it included using a few different programs to make all the needed designs. The model of the building with the city's logo was done with Sketchup as they had an existing builfing model and words needed do be added. Blender was used to add the logo to an existing gimble design, and the cup shown and another were made custom using Solidworks. The logo was converted from Adobe Illustrator, into the respective modelling software",
    "visible": true,
    "open": false,
    "position": 1
  },
  {
    "cell_id": 2,
    "title": "Product Design: Scent Diffuser",
    "skills": "3D CAD (Solidworks) ",
    "pic": "./images/ora/ora2.JPG",
    "pic2": "./images/ora/ora1.png",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "While a student at Simon Fraser University I worked with a student startup to create prototype designs for a app controller scent diffuser. The designs were made to meet a specified artistic design of how it should look along with still making it so functional pieces could fit in it. Solidworks was used for all of the designs and renders of it, a 3D printed version it was used for proof of concept. ",
    "visible": true,
    "open": false,
    "position": 2
  },
  {
    "cell_id": 3,
    "title": "Product Design: Security Keypad",
    "skills": "3D CAD (Solidworks), Adobe Illustrator ",
    "pic": "./images/keypad/keypad1.jpg",
    "pic2": "./images/keypad/keypad2.jpg",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "During my time working for a new company called Plasmatic Technologies Inc.; a company that is making an internet connected home security system I designed some models for their internet connect keypad. These included both a 3D printed version, and then one to simulate what the final version would look like. The final version one used a high quality painted 3D print for the shell and 2 layers of laser cut acrylic to simulate the front. The logo was converted from Adobe Illustrator format to vector, and then imported into Solidworks",
    "visible": true,
    "open": false,
    "position": 3
  },
  {
    "cell_id": 4,
    "title": "Machine Design: Fibre Optics",
    "skills": "3D CAD (Solidworks) ",
    "pic": "./images/fibre/fibre2.png",
    "pic2": "./images/fibre/fibre1.png",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "At my work in Wuhan, China at a company called Yangtze Fibre Optics and Cable Co. I worked on a machine that was used for moving damaged fibre optic strings from a good spool to one where it could be easily removed. Aside from programming the PLC I made some concept designs that I felt could improve the existing machine for the purpose it was being used for. This was a clamp to catch the fibres when they reached the break when being unspooled to prevent it from whipping around.",
    "visible": true,
    "open": false,
    "position": 1
  },
  {
    "cell_id": 5,
    "title": "Side Project: Name Placard",
    "skills": "3D CAD (Solidworks) ",
    "pic": "./images/placard/placard1.png",
    "pic2": "./images/placard/placard2.png",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "As someone who served as VP and President of the Engineering Students Society at SFU, I often represented the school at conferences which including general meetings with voting. At these meeting we had name placards, so I custom designed and printed one for us it to be used to help our school stand out. ",
    "visible": true,
    "open": false,
    "position": 2
  },
  {
    "cell_id": 6,
    "title": "Side Project: Snowman Lantern",
    "skills": "3D CAD (Solidworks) ",
    "pic": "./images/snow/Step 15.JPG",
    "pic2": "./images/snow/Step 3.JPG",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "To be used in an Instructable contest I made a guide on how to make a pumpkin snowman and also create something that looked like it in Solidworks. This project was just done for fun, and to improve my Solidworks skills.",
    "visible": true,
    "open": false,
    "position": 3
  },
  {
    "cell_id": 7,
    "title": "Side Project: Robot Mascot",
    "skills": "3D CAD (Solidworks) ",
    "pic": "./images/robot/robot2.png",
    "pic2": "./images/robot/robot1.png",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "As someone who served as VP and President of the Engineering Students Society at SFU, I felt it would be great to have a mascot that represented us and was also useful. I designed this concept of a robot that could follow people around and also had a fridge on the outside that could bring students drinks and snacks.",
    "visible": true,
    "open": false,
    "position": 1
  },
  {
    "cell_id": 8,
    "title": "Branded Design: Science World",
    "skills": "3D CAD (Solidworks), Adobe Illustrator ",
    "pic": "./images/science/sw1.png",
    "pic2": "./images/no-photo.png",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "This design was done for the at the request of a Science World at Telus World of Science employee to be used as giveaway items. The logo was converted from Adobe Illustrator format to vector, and then imported into Solidworks where it was made into a 3D version of the logo.",
    "visible": true,
    "open": false,
    "position": 2
  }
]
