
[{
    "cell_id": 1,
    "title": "Test Jig: Air Quality Device(Voltage, Current, Frequency, UART)",
    "skills": "Rasberry Pi, Python, i2c, UART, Jig Design(Buttons, Switches, and LED indicators) ",
    "pic": "./images/notifai/testing/aqtest2.jpg",
    "pic2": "./images/notifai/testing/aqtest1.jpg",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "As an engineer at Notifai; a company making enterprise enviromental and air quality sensing solutions, I made a test jig to test the voltage, current, frequency, and UART communication to ensure the quality of our products in the factory. Using a Raspberry Pi with and FTDI(FT4232) to expand communication pins made this possible as all testing modules and displays required UART or I2C. Measurement were taken by pressing pogo pins on key test points. A single button and LED lights were used to easily start testing sequences and show success and failure. Program made using bash script and python.",
    "visible": true,
    "open": false,
    "position": 1
  }
  ,
  {
    "cell_id": 2,
    "title": "Programming Jig: ESP8266 Module",
    "skills": "Raspberry Pi, Python, Bash Scripting, Jig Design(Buttons, Switches, and LED indicators)  ",
    "pic": "./images/notifai/testing/ESPjig1.jpg",
    "pic2": "./images/notifai/testing/ESPjig2.jpg",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "As an engineer at Notifai; a company making enterprise enviromental and air quality sensing solutions, I made a programming jig as some of our devices requires preflashed ESP8266 WiFI communication modules before being placed on our PCB, a simple method for this was needed. It flashed the needed software, and then performed quick checks to ensure it was the correct version and that it could succesfully connect and communicate over WiFi.A single button and LED lights were used to easily start flashing and testing sequences and show success and failure.  Program made using bash script and python.",
    "visible": true,
    "open": false,
    "position": 2
  }
  ,
  {
    "cell_id": 3,
    "title": "Programming Jig: STM8S RGB LED & Button PCB",
    "skills": "IAR IDE, Jig Design(Buttons, Switches, and LED indicators) ",
    "pic": "./images/notifai/testing/LEDjig1.jpg",
    "pic2": "./images/notifai/testing/LEDjig2.jpg",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "As an engineer at Notifai; a company making enterprise enviromental and air quality sensing solutions, I made jig To quickly program an STM8S microcontroller for an LED and button board that sent and recieved UART commands, I made a jig. Using pogo pins it could easily press on the programming pads and be programmed using STs SWIM protocol. Additional pogo pins connected to the power and communciation pins of the board, to give it the necessary power and allow for testing UART communication",
    "visible": true,
    "open": false,
    "position": 3
  },
  {
    "cell_id": 4,
    "title": "Programming Jig: STM32 Air Quality Devices",
    "skills": "Rasberry Pi, UART, Bash Scripting, Jig Design(Buttons, Switches, and LED indicators) ",
    "pic": "./images/notifai/testing/progjig1.jpg",
    "pic2": "./images/notifai/testing/progjig2.jpg",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "As an engineer at Notifai; a company making enterprise enviromental and air quality sensing solutions, I made an updated version of our flashing jig for our air quality sensing devices. My design made it possible to flash all types and sizes of devices on the same jig. Instead of requiring a computer with Linux, just used a Raspberry Pi with the flashing program included. LED and buttons are included to make the flashing process automatic, simple, and user-friendly.",
    "visible": true,
    "open": false,
    "position": 1
  }
  ,
  {
    "cell_id": 5,
    "title": "Manufacturing Jig: QR Code Reader & Sticker Line-up Helper",
    "skills": "Webcam with Python Reader Code, Laser Pointer ",
    "pic": "./images/notifai/testing/qr2.jpg",
    "pic2": "./images/notifai/testing/qr1.jpg",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "As an engineer at Notifai; a company making enterprise enviromental and air quality sensing solutions, I used an X shaped laser pointer in a jig to helps assemblers perfectly place the QR code sticker on the middle of our air quality sensing device. Additionally a camera was linked to a Pi running a QR code sensing program to check its device number. This number then would be automatically transmitted and saved to the device for operation.",
    "visible": true,
    "open": false,
    "position": 2
  }
  ,
  {
    "cell_id": 6,
    "title": "Test Device: Power Supply Cycling",
    "skills": "Parts(Cycle Relay, Enclosure, LED, Displays), Schematic(Altium) ",
    "pic": "./images/corvus/cycle1.png",
    "pic2": "./images/corvus/cycle4.png",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "At Corvus Energy, a company that specilizes in batttery management systems for large industrial and transportation purposes, I worked mainly doing testing. My main task was to build a system to cycle power supplies that convert up to 1024V to 24V and 12V, and to run burn-in and HASS tests on them. This included using a variable transformer with a rectifier, cycle relays to cycle resistive loads, voltage and load inidcators and using parts to create an easy to use enclosure",
    "visible": true,
    "open": false,
    "position": 3
  },
  {
    "cell_id": 7,
    "title": "Test Device: Battery Testing",
    "skills": "Testing(Thermocouples and Heat Cameras, Wave Generators, Etc.) ",
    "pic": "./images/corvus/heat.png",
    "pic2": "./images/corvus/wave.png",
    "pic3": "./images/cityofsurrey/Large Mug.JPG",
    "pic4": "./images/cityofsurrey/Surrey Coin.JPG",
    "description": "At Corvus Energy, a company that specilizes in batttery management systems for large industrial and transportation purposes, I worked mainly doing testing. This included things like temperature testing for lithium-ion battery cells and checking the balance of duty cycle vs. voltage, short circuit tests, assembling and using a high voltage waveform generator to do ripple tests.",
    "visible": true,
    "open": false,
    "position": 1
  }
]